# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
module.app_configuration.data.azurerm_resource_group.hub: Reading...
data.azurerm_private_dns_zone.key_vault: Reading...
data.azurerm_private_dns_zone.blob_storage: Reading...
data.azurerm_private_dns_zone.hub_service_bus: Reading...
module.app_configuration.data.azurerm_client_config.hub: Reading...
data.azurerm_virtual_network.hub_vnet: Reading...
module.app_configuration.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_private_dns_zone.blob_storage: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net]
data.azurerm_virtual_network.hub_vnet: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]
data.azurerm_private_dns_zone.key_vault: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
data.azurerm_private_dns_zone.hub_service_bus: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net]
module.app_configuration.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_private_endpoint.blob must be replaced
-/+ resource "azurerm_private_endpoint" "blob" {
      ~ custom_dns_configs            = [
          - {
              - fqdn         = "staltinnauth001prod.blob.core.windows.net"
              - ip_addresses = [
                  - "10.202.240.5",
                ]
            },
        ] -> (known after apply)
      ~ id                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/privateEndpoints/pepstblobaltinnauth001prod" -> (known after apply)
        name                          = "pepstblobaltinnauth001prod"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/networkInterfaces/nicstblobaltinnauth001prod"
              - name = "nicstblobaltinnauth001prod"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/privateEndpoints/pepstblobaltinnauth001prod/privateDnsZoneGroups/staltinnauth001prod/privateDnsZoneConfigs/privatelink.vaultcore.azure.net"
              - name                = "privatelink.vaultcore.azure.net"
              - private_dns_zone_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                          = {
            "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
            "Environment" = "prod"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/privateEndpoints/pepstblobaltinnauth001prod/privateDnsZoneGroups/staltinnauth001prod" -> (known after apply)
            name                 = "staltinnauth001prod"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "staltinnauth001prod"
          ~ private_connection_resource_id    = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Storage/storageAccounts/staltinnauth001prod" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.202.240.5" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # azurerm_private_endpoint.service_bus_private_endpoint[0] must be replaced
-/+ resource "azurerm_private_endpoint" "service_bus_private_endpoint" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/privateEndpoints/pesbaltinnauth001prod" -> (known after apply)
      ~ name                          = "pesbaltinnauth001prod" -> "pepsbaltinnauth001prod" # forces replacement
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/networkInterfaces/nicsbsbaltinnauth001prod"
              - name = "nicsbsbaltinnauth001prod"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/privateEndpoints/pesbaltinnauth001prod/privateDnsZoneGroups/sbaltinnauth001prod/privateDnsZoneConfigs/privatelink.servicebus.windows.net"
              - name                = "privatelink.servicebus.windows.net"
              - private_dns_zone_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "sbaltinnauth001prod.privatelink.servicebus.windows.net"
                      - ip_addresses = [
                          - "10.202.244.4",
                        ]
                      - name         = "sbaltinnauth001prod"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      - tags                          = {} -> null
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/privateEndpoints/pesbaltinnauth001prod/privateDnsZoneGroups/sbaltinnauth001prod" -> (known after apply)
            name                 = "sbaltinnauth001prod"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "sbaltinnauth001prod"
          ~ private_ip_address                = "10.202.244.4" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # azurerm_servicebus_namespace.service_bus will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "service_bus" {
        id                                  = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001prod"
        name                                = "sbaltinnauth001prod"
        tags                                = {
            "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
            "Environment" = "prod"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (13 unchanged attributes hidden)

      ~ network_rule_set {
          ~ public_network_access_enabled = true -> false
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_storage_account.storage must be replaced
-/+ resource "azurerm_storage_account" "storage" {
      ~ access_tier                        = "Hot" -> (known after apply)
      ~ account_kind                       = "StorageV2" -> "BlockBlobStorage" # forces replacement
      ~ account_replication_type           = "GRS" -> "LRS"
      ~ account_tier                       = "Standard" -> "Premium" # forces replacement
      ~ allow_nested_items_to_be_public    = true -> false
      ~ id                                 = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Storage/storageAccounts/staltinnauth001prod" -> (known after apply)
      ~ large_file_share_enabled           = false -> (known after apply)
        name                               = "staltinnauth001prod"
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://staltinnauth001prod.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "staltinnauth001prod.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://staltinnauth001prod.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "staltinnauth001prod.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://staltinnauth001prod.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "staltinnauth001prod.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "norwayeast" -> (known after apply)
      ~ primary_queue_endpoint             = "https://staltinnauth001prod.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "staltinnauth001prod.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://staltinnauth001prod.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "staltinnauth001prod.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://staltinnauth001prod.z1.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "staltinnauth001prod.z1.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      ~ secondary_location                 = "norwaywest" -> (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
            "Environment" = "prod"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (18 unchanged attributes hidden)

      ~ blob_properties {
          - change_feed_retention_in_days = 0 -> null
          + default_service_version       = (known after apply)
          ~ versioning_enabled            = false -> true
            # (2 unchanged attributes hidden)
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "8ed86341-cdc3-4175-9cc7-46bdb6d6fafc" -> (known after apply)
          ~ tenant_id    = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ network_rules (known after apply)

      ~ queue_properties (known after apply)
      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      ~ routing (known after apply)

      ~ share_properties (known after apply)
      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

      ~ static_website (known after apply)
    }

  # azurerm_storage_container.lease must be replaced
-/+ resource "azurerm_storage_container" "lease" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Storage/storageAccounts/staltinnauth001prod/blobServices/default/containers/leases" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "leases"
      ~ resource_manager_id               = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Storage/storageAccounts/staltinnauth001prod/blobServices/default/containers/leases" -> (known after apply)
      ~ storage_account_id                = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Storage/storageAccounts/staltinnauth001prod" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.app_configuration.azurerm_app_configuration_key.key_value["Lease:StorageAccount:BlobEndpoint_prod"] will be created
  + resource "azurerm_app_configuration_key" "key_value" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Lease:StorageAccount:BlobEndpoint"
      + label                  = "prod"
      + locked                 = false
      + type                   = "kv"
      + value                  = (known after apply)
    }

  # module.app_configuration.azurerm_app_configuration_key.key_value["Platform:RegisterEndpoint_prod"] will be created
  + resource "azurerm_app_configuration_key" "key_value" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Platform:RegisterEndpoint"
      + label                  = "prod"
      + locked                 = false
      + type                   = "kv"
      + value                  = "http://altinn-register.default.svc.cluster.local"
    }

  # module.app_configuration.azurerm_app_configuration_key.key_value["Platform:ResourceRegistryEndpoint_prod"] will be created
  + resource "azurerm_app_configuration_key" "key_value" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Platform:ResourceRegistryEndpoint"
      + label                  = "prod"
      + locked                 = false
      + type                   = "kv"
      + value                  = "http://altinn-resource-registry.default.svc.cluster.local"
    }

Plan: 7 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/spoke` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/prod/spokes.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_prod_spokes.tfstate.tfplan`